<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"a060c5a2a149fe6a0c0c5938abaec1ef60fb5d0cdfa58757421b214087470eef","plan_job_ref":"Job Staging Image Build & Push #21 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7350851034","plan_hash":"0cdb27974b6a48b20ef530ff7368cd20f192858ad3ef0958c7f446bad3260e1f","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 3 to add, 4 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:19" -> (known after apply)
#        (16 unchanged attributes hidden)

-       load_balancer {
-           container_name   = "dev_FastAPI_image" -> null
-           container_port   = 5000 -> null
-           target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev/e1b20e4427cfef44" -> null
        }
+       load_balancer {
+           container_name   = "dev_FastAPI_image"
+           container_port   = 5000
+           target_group_arn = (known after apply)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:19" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   environment  = []
!~                  image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:6bd3351403de3b4f05662bf45ac1951425e73e69" -> "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:b8e217cac0eb7d4aa82f7d61c7393183b9306b82"
-                   mountPoints  = []
                    name         = "dev_FastAPI_image"
!~                  portMappings = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   volumesFrom  = []
#                    (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "*********************" -> (known after apply)
!~      revision                 = 19 -> (known after apply)
-       tags                     = {} -> null
#        (7 unchanged attributes hidden)
    }

  # aws_lb_listener.listerner will be created
+   resource "aws_lb_listener" "listerner" {
+       arn               = (known after apply)
+       certificate_arn   = "arn:aws:acm:eu-central-1:806066816337:certificate/ce157388-cd24-4841-9044-fbd2ab762400"
+       id                = (known after apply)
+       load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:loadbalancer/app/fastapi-lb-dev/78fa42d138c4f3f0"
+       port              = 443
+       protocol          = "HTTPS"
+       ssl_policy        = "ELBSecurityPolicy-TLS13-1-2-2021-06"
+       tags_all          = {
+           "Environment" = "Dev Environment"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # aws_lb_target_group.target_group must be replaced
-/+ resource "aws_lb_target_group" "target_group" {
!~      arn                                = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev/e1b20e4427cfef44" -> (known after apply)
!~      arn_suffix                         = "targetgroup/alb-target-group-dev/e1b20e4427cfef44" -> (known after apply)
+       connection_termination             = (known after apply)
!~      id                                 = "********************************************************************************************************" -> (known after apply)
!~      ip_address_type                    = "ipv4" -> (known after apply)
!~      load_balancing_algorithm_type      = "round_robin" -> (known after apply)
!~      load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "alb-target-group-dev"
+       name_prefix                        = (known after apply)
+       preserve_client_ip                 = (known after apply)
!~      protocol                           = "HTTPS" -> "HTTP" # forces replacement
!~      protocol_version                   = "HTTP1" -> (known after apply)
-       tags                               = {} -> null
#        (8 unchanged attributes hidden)

-       health_check {
-           enabled             = true -> null
-           healthy_threshold   = 5 -> null
-           interval            = 30 -> null
-           matcher             = "200" -> null
-           path                = "/" -> null
-           port                = "traffic-port" -> null
-           protocol            = "HTTPS" -> null
-           timeout             = 5 -> null
-           unhealthy_threshold = 2 -> null
        }

-       stickiness {
-           cookie_duration = 86400 -> null
-           enabled         = false -> null
-           type            = "lb_cookie" -> null
        }

-       target_failover {}

-       target_health_state {}
    }

  # aws_route53_record.record will be updated in-place
!~  resource "aws_route53_record" "record" {
        id                               = "Z0822301268JPSC1M6XE6_test.fastapi.dennisowie.com_A"
        name                             = "test.fastapi.dennisowie.com"
#        (6 unchanged attributes hidden)

!~      alias {
!~          name                   = "dualstack.demo-898495994.eu-central-1.elb.amazonaws.com" -> "fastapi-lb-dev-811773905.eu-central-1.elb.amazonaws.com"
#            (2 unchanged attributes hidden)
        }
    }

  # aws_security_group.ALB_to_containers will be updated in-place
!~  resource "aws_security_group" "ALB_to_containers" {
        id                     = "sg-091e964d65dee5150"
!~      ingress                = [
-           {
-               cidr_blocks      = [
-                   "0.0.0.0/0",
                ]
-               description      = ""
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 65535
            },
+           {
+               cidr_blocks      = []
+               description      = "Inbound ALB to ECS containers"
+               from_port        = 5000
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = [
+                   "sg-052ce8f0ae0d6fabe",
                ]
+               self             = false
+               to_port          = 5000
            },
        ]
        name                   = "alb-to-containers-dev"
        tags                   = {}
#        (7 unchanged attributes hidden)
    }

  # aws_security_group.internet_to_ALB will be updated in-place
!~  resource "aws_security_group" "internet_to_ALB" {
        id                     = "sg-052ce8f0ae0d6fabe"
!~      ingress                = [
-           {
-               cidr_blocks      = [
-                   "0.0.0.0/0",
                ]
-               description      = ""
-               from_port        = 80
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 80
            },
-           {
-               cidr_blocks      = [
-                   "0.0.0.0/0",
                ]
-               description      = "Inbound from Internet to ALB"
-               from_port        = 443
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 443
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allowing http traffic to ALB from the internet"
+               from_port        = 80
+               ipv6_cidr_blocks = [
+                   "::/0",
                ]
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allowing https traffic to ALB from the internet"
+               from_port        = 443
+               ipv6_cidr_blocks = [
+                   "::/0",
                ]
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
            },
        ]
        name                   = "internet-to-alb-dev"
        tags                   = {}
#        (7 unchanged attributes hidden)
    }

Plan: 3 to add, 4 to change, 2 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Image Build & Push #21](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7350851034)
<details open><summary>Outputs</summary>

```hcl
ecr_registry_id     = "806066816337"
ecr_repository_name = "dev/irezd/fastapi"
```
</details>